{"authorDailyContributionsMap":{"georgepwhuang":[{"date":"2021-01-19","commitResults":[{"hash":"6e6e8c115ee1c4758c96151955d5437d93466b30","messageTitle":"Implement greet, echo and exit","messageBody":"Project starts with a basic skeletal version.\n\nLet\u0027s allow BLARB, which is this version of Duke to greet the users\nand exit when called, and to echo all other unrecognized commands.\n\nThe skeletal version is to kick off the project without complications.\n","fileTypesAndContributionMap":{"java":{"insertions":32,"deletions":6}}},{"hash":"dfdc2a6247537535941368d55acb4c2801e7404d","messageTitle":"Add comments and change variable names","messageBody":"Increase clarity on the functionality of the code.\n\nVariable names are changed to fit the problem statement.\n","tags":["Level-1"],"fileTypesAndContributionMap":{"java":{"insertions":9,"deletions":4}}},{"hash":"9debf00fab91ad00c9653ff0c4133f4824de7f3d","messageTitle":"Implement add and list","messageBody":"BLARB should store and list text inputted by the user.\n\nEdit the echo utility into storing the inputted text.\nAdd listing utility to call stored text.\n\nSuch utility is used to later further implement other functions.\n","tags":["Level-2"],"fileTypesAndContributionMap":{"java":{"insertions":20,"deletions":2}}},{"hash":"b9428745e2998173f02e578f2a14ce2977ef74f7","messageTitle":"Implement ability to mark tasks as done","messageBody":"Allow stored tasks to function as checklist.\n\nConverted storage from Strings to self-defined immutable class Task.\n\nThis is so that the completion attribute is bundled with the task,\nrather than separately denoted.\n","tags":["Level-3"],"fileTypesAndContributionMap":{"java":{"insertions":64,"deletions":17}}},{"hash":"c20624154654a5523518f04aee036f69b3ef448a","messageTitle":"Add support for different types of Tasks","messageBody":"There are different types of tasks and their properties\nshould be taken into account.\n\nCreated three subtypes of Task. Changed Task to a mutable\nclass and allow toggling of the completion status.\nParsing of the input strings by split() is implemented.\n\nThe immutable state of the Task class is undesirable\nfor inheritance. Parsing method is made to fit the\ncommand-description style of input.\n","fileTypesAndContributionMap":{"java":{"insertions":133,"deletions":30}}},{"hash":"98d62c13ec8e2b234554a76c71eba68bb71fc4bd","messageTitle":"Abstract chat functions to a separate class","messageBody":"The Duke class is messy and not written in an object-oriented style.\n\nAbstracted all chatting functions to new class so that the Duke\nclass only does the logo printing and input looping.\n\nThe main class is made cleaner and the chatting functions are\nrewritten in OOP style to clear the code and enhance readability.\n","tags":["Level-4"],"fileTypesAndContributionMap":{"java":{"insertions":110,"deletions":66}}},{"hash":"06f33d5e3688ce1045357534d781d10e45b4f0ee","messageTitle":"Implement shell script testing","messageBody":"Shell script testing is used to faster debug the code.\n\nCreated test case and fixed minor bugs in the output in order to\ndecrease issues in the shell script, namely, the spaces at the end\nof output lines are deleted.\n\nSpaces at the end of a line cause comparability issues, and causes\nthe shell script to fail test cases even if outputs are the same.\n","tags":["A-TextUiTesting"],"fileTypesAndContributionMap":{"txt":{"insertions":7,"deletions":0},"java":{"insertions":5,"deletions":4}}},{"hash":"0735bf2c7b5b190971f67923d31af699ff8c4d46","messageTitle":"Increase exception handling cases","messageBody":"The code should have more flexibility for the acceptance of exceptions.\n\nVarious try-catch blocks are added to catch different exception types\nand to give different responses according to.\n\nThe use of Java inbuilt exceptions are used directly rather than self-\ndefined ones are due to the inbuilt exceptions being sufficient for\nthe current exceptions that may be caught.\n","tags":["Level-5"],"fileTypesAndContributionMap":{"txt":{"insertions":9,"deletions":6},"java":{"insertions":32,"deletions":10}}},{"hash":"9974edd2af9570887fedd269c12909aff167911f","messageTitle":"Add delete function","messageBody":"The user should be able to delete tasks that are no longer needed.\n\nA delete function is added to the code. Some Integer types are changed\nto int types.\n\nThe conversion of reference types to primitive types is implemented\nin order allow easier deletions in ArrayLists.\n","tags":["Level-6"],"fileTypesAndContributionMap":{"txt":{"insertions":7,"deletions":9},"java":{"insertions":24,"deletions":1}}},{"hash":"705cdaafe29adab2837f781b45d829ca6c48f035","messageTitle":"Convert commands to enum types","messageBody":"The commands in the Blarb class is implemented through a long\nif-else if-else block, while switch-case blocks would allow cleaner\ncode.\n\nThe enum type for commands are created, and the long if-else if-else\nblock in Blarb.java is replaced with a switch-case.\n\nThe enum type is used in order to allow for the switch-case block to\nbe used as it only accepted single variable types.\n","fileTypesAndContributionMap":{"java":{"insertions":88,"deletions":47}}},{"hash":"cff64a79b8f1811e3e810388ad46385f13aa57bb","messageTitle":"Add values to enum type Command and reformatted code","messageBody":"The Command class is still dependant on a long if-else is-else block.\n\nString values are attached to each Command.\nCleaned code to fit Java coding standards.\n\nCommands can be called directly from the input string rather than\ngoing through a long selection block.\n","tags":["A-Enums"],"fileTypesAndContributionMap":{"java":{"insertions":83,"deletions":71}}}]}]},"authorFileTypeContributionMap":{"georgepwhuang":{"java":346,"md":0,"fxml":0,"sh":0,"bat":0,"gradle":0,"txt":8}},"authorContributionVariance":{"georgepwhuang":79290.47},"authorDisplayNameMap":{"georgepwhuang":"HUAN.. WEI"}}
